# Excel demonstration

In [2]:
%load_ext sql
%sql sqlite:///jupyter_sql_tutorial.db

##### Identify all the distinct airlines

In [9]:
%%sql
select * 
from airlines

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'UA', 'United Air Lines Inc.'),
 (1, 'AA', 'American Airlines Inc.'),
 (2, 'US', 'US Airways Inc.'),
 (3, 'F9', 'Frontier Airlines Inc.'),
 (4, 'B6', 'JetBlue Airways'),
 (5, 'OO', 'Skywest Airlines Inc.'),
 (6, 'AS', 'Alaska Airlines Inc.'),
 (7, 'NK', 'Spirit Air Lines'),
 (8, 'WN', 'Southwest Airlines Co.'),
 (9, 'DL', 'Delta Air Lines Inc.'),
 (10, 'EV', 'Atlantic Southeast Airlines'),
 (11, 'HA', 'Hawaiian Airlines Inc.'),
 (12, 'MQ', 'American Eagle Airlines Inc.'),
 (13, 'VX', 'Virgin America')]

##### Get the information for the longuest flight (in KM) per company

In [10]:
%%sql
select AIRLINE ,max(DISTANCE)
from flights
group by 1

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('AA', 3784),
 ('AS', 2874),
 ('B6', 2704),
 ('DL', 4983),
 ('EV', 1330),
 ('F9', 2065),
 ('HA', 4983),
 ('MQ', 1236),
 ('NK', 2342),
 ('OO', 1735),
 ('UA', 4962),
 ('US', 2979),
 ('VX', 2704),
 ('WN', 2447)]

##### Busiest day for the top 10 biggest airport

In [44]:
%%sql

with top_airport as (select ORIGIN_AIRPORT, count(*)
from flights
group by 1
order by 2 desc
limit 10),

Ranking_days as (
select F.ORIGIN_AIRPORT,
F.YEAR*10000+F.Month*100+F.DAY as date, 
count(*)  departure_number,
RANK() OVER (PARTITION BY F.ORIGIN_AIRPORT ORDER BY count(*) DESC) as ranking
from flights F
    join top_airport T
    on F.ORIGIN_AIRPORT = T.ORIGIN_AIRPORT
group by 1,2 
order by 1,2)

select A.AIRPORT,
CITY,
R.date,
R.departure_number
from Ranking_days R
join airport A
on R.ORIGIN_AIRPORT = A.IATA_CODE
where ranking=1
order by departure_number desc

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Hartsfield-Jackson Atlanta International Airport', 'Atlanta', 20150213, 1069),
 ("Chicago O'Hare International Airport", 'Chicago', 20150220, 847),
 ('Dallas/Fort Worth International Airport', 'Dallas-Fort Worth', 20150102, 809),
 ('Denver International Airport', 'Denver', 20150102, 658),
 ('Los Angeles International Airport', 'Los Angeles', 20150102, 640),
 ('George Bush Intercontinental Airport', 'Houston', 20150102, 508),
 ('San Francisco International Airport', 'San Francisco', 20150102, 493),
 ('Phoenix Sky Harbor International Airport', 'Phoenix', 20150102, 487),
 ('McCarran International Airport', 'Las Vegas', 20150220, 399),
 ('Orlando International Airport', 'Orlando', 20150103, 360)]